Table of Contents
 Class ResultOfDeformation2
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of deformation in the one positon
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfDeformation2 : ResultOfLoading2
Inheritance
object
ResultOfLoading2
ResultOfDeformation2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfDeformation2()
Constructor
public ResultOfDeformation2()
Properties
 Fix
Rotation around x-axis
public double Fix { get; set; }
Property Value
double
 Fiy
Rotation around y-axis
public double Fiy { get; set; }
Property Value
double
 Fiz
Rotation around z-axis
public double Fiz { get; set; }
Property Value
double
 Loading
LoadingTypeClass
public Loading Loading { get; set; }
Property Value
Loading
 Ux
Deformation in the x direction
public double Ux { get; set; }
Property Value
double
 Uy
Deformation in the y direction
public double Uy { get; set; }
Property Value
double
 Uz
Deformation in the z direction
public double Uz { get; set; }
Property Value
double
 Edit this page